demo3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 10 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 0 10 );
    }
    AMI1
    {
        type            cyclicAMI;
    }
    AMI2
    {
        type            cyclicAMI;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            slip;
    }
    hub
    {
        type            movingWallVelocity;
        value           uniform ( 0 0 0 );
    }
    "(blade.*)"
    {
        type            movingWallVelocity;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
